Section_4_Real_Workload_Validation/Experiment13/data/raw/case-C/sustained-ramp/trial_011/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 51.614ms, rate sampling interval: 131ms
  Thread calibration: mean lat.: 51.666ms, rate sampling interval: 130ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    39.66ms   26.33ms 530.94ms   95.60%
    Req/Sec   150.13     28.20   407.00     77.91%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   34.37ms
 75.000%   38.75ms
 90.000%   50.11ms
 99.000%  114.62ms
 99.900%  480.00ms
 99.990%  525.31ms
 99.999%  531.46ms
100.000%  531.46ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      27.791     0.000000            1         1.00
      30.399     0.100000         5113         1.11
      31.311     0.200000        10215         1.25
      32.335     0.300000        15294         1.43
      33.343     0.400000        20531         1.67
      34.367     0.500000        25625         2.00
      34.911     0.550000        28119         2.22
      35.551     0.600000        30669         2.50
      36.319     0.650000        33137         2.86
      37.375     0.700000        35694         3.33
      38.751     0.750000        38262         4.00
      39.647     0.775000        39534         4.44
      40.863     0.800000        40810         5.00
      42.335     0.825000        42078         5.71
      44.031     0.850000        43352         6.67
      46.591     0.875000        44615         8.00
      48.127     0.887500        45252         8.89
      50.111     0.900000        45887        10.00
      52.479     0.912500        46525        11.43
      55.231     0.925000        47162        13.33
      58.719     0.937500        47802        16.00
      60.959     0.943750        48114        17.78
      63.551     0.950000        48436        20.00
      66.175     0.956250        48751        22.86
      69.439     0.962500        49068        26.67
      73.535     0.968750        49386        32.00
      76.031     0.971875        49547        35.56
      79.935     0.975000        49705        40.00
      84.671     0.978125        49864        45.71
      90.239     0.981250        50024        53.33
      97.279     0.984375        50183        64.00
     101.759     0.985938        50267        71.11
     105.599     0.987500        50342        80.00
     111.679     0.989062        50422        91.43
     117.119     0.990625        50504       106.67
     123.455     0.992188        50581       128.00
     128.191     0.992969        50621       142.22
     133.375     0.993750        50661       160.00
     141.311     0.994531        50701       182.86
     156.799     0.995313        50741       213.33
     207.999     0.996094        50780       256.00
     231.679     0.996484        50800       284.44
     286.975     0.996875        50820       320.00
     309.503     0.997266        50840       365.71
     357.119     0.997656        50860       426.67
     411.903     0.998047        50880       512.00
     423.167     0.998242        50891       568.89
     430.591     0.998437        50900       640.00
     444.927     0.998633        50910       731.43
     465.151     0.998828        50920       853.33
     483.583     0.999023        50930      1024.00
     489.215     0.999121        50937      1137.78
     494.335     0.999219        50941      1280.00
     499.711     0.999316        50945      1462.86
     504.063     0.999414        50950      1706.67
     508.159     0.999512        50955      2048.00
     508.671     0.999561        50957      2275.56
     512.767     0.999609        50962      2560.00
     512.767     0.999658        50962      2925.71
     515.327     0.999707        50965      3413.33
     517.887     0.999756        50969      4096.00
     517.887     0.999780        50969      4551.11
     519.167     0.999805        50970      5120.00
     519.935     0.999829        50971      5851.43
     521.727     0.999854        50972      6826.67
     523.007     0.999878        50973      8192.00
     525.311     0.999890        50974      9102.22
     525.823     0.999902        50975     10240.00
     525.823     0.999915        50975     11702.86
     526.847     0.999927        50977     13653.33
     526.847     0.999939        50977     16384.00
     526.847     0.999945        50977     18204.44
     526.847     0.999951        50977     20480.00
     526.847     0.999957        50977     23405.71
     531.455     0.999963        50979     27306.67
     531.455     1.000000        50979          inf
#[Mean    =       39.663, StdDeviation   =       26.326]
#[Max     =      530.944, Total count    =        50979]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  54002 requests in 3.00m, 43.93MB read
Requests/sec:    299.93
Transfer/sec:    249.84KB